---
title: VertexBuffer
classe: Autodesk.Revit.DB.DirectContext3D.VertexBuffer
namespace: Autodesk.Revit.DB.DirectContext3D
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# VertexBuffer

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `vertexBuffer.IsValidObject` | Boolean |
| `Void Dispose()` | `vertexBuffer.Dispose()` | Void |
| `IntPtr GetMappedHandle()` | `vertexBuffer.GetMappedHandle()` | IntPtr |
| `VertexStreamPosition GetVertexStreamPosition()` | `vertexBuffer.GetVertexStreamPosition()` | VertexStreamPosition |
| `VertexStreamPositionColored GetVertexStreamPositionColored()` | `vertexBuffer.GetVertexStreamPositionColored()` | VertexStreamPositionColored |
| `VertexStreamPositionNormal GetVertexStreamPositionNormal()` | `vertexBuffer.GetVertexStreamPositionNormal()` | VertexStreamPositionNormal |
| `VertexStreamPositionNormalColored GetVertexStreamPositionNormalColored()` | `vertexBuffer.GetVertexStreamPositionNormalColored()` | VertexStreamPositionNormalColored |
| `Boolean IsValid()` | `vertexBuffer.IsValid()` | Boolean |
| `Void Map(Int32)` | `vertexBuffer.Map(sizeInFloats)` | Void |
| `Void Unmap()` | `vertexBuffer.Unmap()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```